##2.#计算一个12.5m*16.7m的矩形房间的面积和周长
a=12.5
b=16.7
mj=a*b
zc=2*(a+b)
print('面积=',mj,' 周长=',zc)
##3.#怎么得到9/2的小数结果
c=float(9/2)
print(c)
##4.#python计算中7*7*7*7.可以有多少种写法
print(pow(7,4))
print(7**4)
#写程序将温度从华氏温度转换为摄氏温度。转换公式为C=5/9*(F-32)
##F=input()
#C=5/9*(int(F)-32)
#print(C)
#一家商场在降价促销。如果购买金额50-100元(包含50元和100元)之间，会给10%的折扣，
# 如果购买金额大于100元会给20%折扣。编写一程序，询问购买价格，再显示出折扣（%10或20%）和最终价格
a=123
def ttt(a):
    if a>50 and a<100:
        c=0.1;
    if a>100:
        c=0.2
    return c
print(ttt(a))
#7.#判断一个数n能同时被3和5整除
a=111
if a%3==0 and a%5==0:
    print(a,'可以被整除');
else:
    print(a, '不可以被整除');
#求1+2+3+...+100（第三种）
#14.#3个人在餐厅吃饭，想分摊饭费。总共花费35.27美元，他们还想给15%的消费。每个人该怎么付钱
print(35.27*1.15/3)
#16、打印10到1的数字：
a=10
while a>0:
    print(a)
    a-=1;
# 22.#嵌套循环输出10-50中个位带有1-5的所有数字
for i in range(10,50):
    if str(i)[1] in ["1","2","3","4","5"]:
        print(str(i)[0])
        print(i);
#23、输入1-127的ascii码并输出对应字符
for i in range(1,128):
    print(chr(i))